<a href="https://colab.research.google.com/github/alexandergribenchenko/Data_Science_Self_Study/blob/main/Pandas/DS_Pandas_00_Recursos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 01. Librer√≠as a importar

In [2]:
import pandas as pd
import math
import numpy as np

# **02. Funciones Pandas**

## Dataframe vacio

In [ ]:
pd.DataFrame?

In [ ]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

## Crear dataframe a partir de listas

In [ ]:
a = [1,3,3,np.nan, 5]

In [ ]:
b = [1,3,3,3,5]

In [ ]:
c = [1,2,3,4,5]

In [ ]:
df = pd.DataFrame(list(zip(a,b,c)), 
                   columns=['aaa','bbb','ccc'])
df

   aaa  bbb  ccc
0  1.0    1    1
1  3.0    3    2
2  3.0    3    3
3  NaN    3    4
4  5.0    5    5

## Crear un dataframe a partir de series

In [ ]:
author = ['Jitender', 'Purnima', 'Arpit', 'Jyoti']
article = [210, 211, 114, 178]
  
auth_series = pd.Series(author)
article_series = pd.Series(article)
  
frame = { 'Author': auth_series, 'Article': article_series }
  
df = pd.DataFrame(frame)
df

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178

## M√©todo filter (df) Filtrado de columnas del DataFrame a partir de regex

In [ ]:
a = [1,3,3,np.nan, 5]

In [ ]:
b = [1,3,3,3,5]

In [ ]:
c = [1,2,3,4,5]

In [ ]:
df = pd.DataFrame(list(zip(a,b,c)), 
                   columns=['aaa','bbb','ccc'])
df

   aaa  bbb  ccc
0  1.0    1    1
1  3.0    3    2
2  3.0    3    3
3  NaN    3    4
4  5.0    5    5

In [ ]:
df.filter(regex='aa|b|d')

   aaa  bbb
0  1.0    1
1  3.0    3
2  3.0    3
3  NaN    3
4  5.0    5

## M√©todo contains (series) Filtrado de filas de una serie a partir de regex

In [ ]:
author = ['Jitender', 'Purnima', 'Arpit', 'Jyoti']
article = [210, 211, 114, 178]
  
auth_series = pd.Series(author)
article_series = pd.Series(article)
  
frame = { 'Author': auth_series, 'Article': article_series }
  
df = pd.DataFrame(frame)
df

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178

In [ ]:
df[df.Author.str.contains('ima|er', regex=True)]

     Author  Article
0  Jitender      210
1   Purnima      211

## M√©todo Rank (df) (percentiles por columna)

In [ ]:
a = [1,3,3,np.nan, 5]

In [ ]:
b = [1,3,3,3,5]

In [ ]:
c = [1,2,3,4,5]

In [ ]:
df = pd.DataFrame(list(zip(a,b,c)), 
                   columns=['aaa','bbb','ccc'])
df

   aaa  bbb  ccc
0  1.0    1    1
1  3.0    3    2
2  3.0    3    3
3  NaN    3    4
4  5.0    5    5

In [ ]:
df['bbb'].quantile(0.6)

3.0

In [ ]:
# Nos entrega el percentil que cada valor representra dentro de la distribuci√≥n de su columna
df.rank(pct=True)

     aaa  bbb  ccc
0  0.250  0.2  0.2
1  0.625  0.6  0.4
2  0.625  0.6  0.6
3    NaN  0.6  0.8
4  1.000  1.0  1.0

## M√©todo stack (df) (reshape a la forma: registo, parametro, valor)

In [ ]:
df = pd.DataFrame([[0, 1, 3], ['mico', 'perro', 'gato']],
                                    index=['f1', 'f2'],
                                    columns=['c1', 'c2', 'c3'])
df

      c1     c2    c3
f1     0      1     3
f2  mico  perro  gato

In [ ]:
df.stack().reset_index().rename(columns={'level_0':'ex_filas', 'level_1':'ex_columnas', 0:'ex_valores'})

  ex_filas ex_columnas ex_valores
0       f1          c1          0
1       f1          c2          1
2       f1          c3          3
3       f2          c1       mico
4       f2          c2      perro
5       f2          c3       gato

## Reemplazos con diccionario

In [4]:
technologies= {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Duration':['30days','50days','30days', None,np.nan],
    'Discount':[1000,2300,1000,1200,2500]
          }
df = pd.DataFrame(technologies)
df

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300
2   Hadoop  23000   30days      1000
3   Python  24000     None      1200
4   Pandas  26000      NaN      2500

In [5]:
dict = {"Spark" : 'S', "PySpark" : 'P', "Hadoop": 'H', "Python" : 'P', "Pandas": 'P'}
df2=df.replace({"Courses": dict})
print(df2)

  Courses    Fee Duration  Discount
0       S  22000   30days      1000
1       P  25000   50days      2300
2       H  23000   30days      1000
3       P  24000     None      1200
4       P  26000      NaN      2500